namespace bank;
//неизменяемый тип данных, который может содержать только свойства и методы, но не поля. Он используется для представления неизменяемых объектов, таких как транзакции в банковской системе.
/// <summary>
/// Описывает единичную финансовую операцию на счете, фиксируя её размер, 
/// точное время проведения и сопроводительное описание.
/// </summary>
/// <param name="Amount">Размер денежного перевода или списания</param>
/// <param name="Date">Временная метка совершения операции</param>
/// <param name="Note">Комментарий или назначение платежа</param>
public record Transaction(decimal Amount, DateTime Date, string Note);
